Revit 2027 API
BuiltInFailures.EditingFailures.DeletedRequestedWarn Property
 You have deleted elements that other users requested.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DeletedRequestedWarn { get; }
Public Shared ReadOnly Property DeletedRequestedWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DeletedRequestedWarn {
	FailureDefinitionId^ get ();
}
static member DeletedRequestedWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace